MansAbboud/BLE5-Testbed/code/nRF52840_Observer_main.c
// Observer


#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdio.h>
#include "radio_config.h"
#include "nrf_gpio.h"
#include "boards.h"
#include "bsp.h"
#include "app_timer.h"
#include "nordic_common.h"
#include "nrf_error.h"
#include "app_error.h"
#include "nrf_drv_gpiote.h" 
#include "nrf_nvic.h" 
#include "app_uart.h" 
#include "nrf_delay.h"
#include "app_button.h"
#include "nrf_drv_timer.h"
#include "nrf.h"




const  nrf_drv_timer_t M_STOP_TIMER = NRF_DRV_TIMER_INSTANCE(0);  /* Timer 1 instance */
const  nrf_drv_timer_t MEASUREMENT_TIMER = NRF_DRV_TIMER_INSTANCE(1);  /* Timer 1 instance */
const  nrf_drv_timer_t TIMESTAMP_TIMER = NRF_DRV_TIMER_INSTANCE(2);    // Timer 2 instance  */

static uint8_t volatile le_min_packet_rx[PDU_LENGTH_LE_MIN];          /* Received packet buffer for minimum packet data length */
static uint8_t volatile le_adv_packet_rx[PDU_LENGTH_LE_ADV];           /* Received packet buffer for le advetrising packet */
static uint8_t volatile le_data_packet_rx[PDU_LENGTH_LE_DATA];         /* Received packet buffer for le data packet */
static uint8_t volatile trigger_packet_tx[PDU_LENGTH_LE_ADV];          /* Received trigger packet buffer */

uint8_t OB_addr[LE_ADDR_LENGTH]={0x33,0x33,0x33,0x33,0x33,0x33};       /* Observer device address  */

// Local variables//

uint32_t PACKET_COUNT = 250;
uint32_t SCAN_INTERVAL = 600;
uint32_t printing_delay = 400;
uint32_t waiting_delay = 300;


uint8_t ble_addr[6];	
uint16_t B1_packet_counter;
uint16_t B2_packet_counter;
uint8_t real_time_seconds;
uint8_t real_time_minutes;
uint8_t real_time_hours;
uint32_t current_time;
uint32_t current_tick;
bool time_set = false;
bool tp_sent = false;
bool measuring = false; 
bool B1_rec_ind = false; 
bool broadcaster_missed = true;
uint8_t B1_rec_packets_rssi[504];
uint8_t controlArray[6];
uint8_t uart_rx_buffer[502];
uint16_t uart_rx_buffer_idx;
uint32_t array_counter=0;
uint8_t rssi_counter=1;
uint8_t uart_idx=1;
uint8_t recValue;
uint8_t batch_counter=1;
uint8_t idx_counter=1;
uint8_t data_idx_counter=1;
uint8_t rssi_result;
uint8_t PER;
uint8_t PACKET_CONFIG;
uint8_t BLE_MODE;
uint8_t TX_POW;
uint8_t CHANNEL;
uint8_t scenario;



char *radio__mode[]={"","1Mbit", "2Mbit", "500Kbit S=2", "125Kbit S=8"};
char *packet__config[]={"","Avg (Adv), 31 Bytes", "Min, 1 Byte", "Max, 255 Bytes" };
char *tx__power[]={"", "+8dBm", "0dBm", "-8dBm", "-20dBm"};    


/* aFunction for handling UART errors */
void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

/* Powering up radio  */
void radio_power_up(void)
{
/* Power up and reset all states in the radio peripheral */
	NRF_RADIO->POWER = 1;
	NRF_RADIO->EVENTS_DISABLED = 0; 
 	
}

/* Configuring CRC  */
void radio_CRC_init(void)
{
 /* CRC config */
  NRF_RADIO->CRCCNF  = (RADIO_CRCCNF_LEN_Three << RADIO_CRCCNF_LEN_Pos) | 
                       (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos); /* Skip Address when computing crc */    
  NRF_RADIO->CRCINIT = 0x555555;    // Initial value of CRC
  NRF_RADIO->CRCPOLY = 0x00065B;    // CRC polynomial function
 	
}

/* Setting interframe spacing */
void radio_tifs_set(void)
{	
	NRF_RADIO->TIFS = 150; 	
}

/* Configuring Access Address  */
void radio_addr_init(void)
{
	
	/* Configure Access Address to be the BLE standard */
	NRF_RADIO->BASE0 		 = 0x89BED600;
  NRF_RADIO->PREFIX0	 = 0x0000008E; 
  NRF_RADIO->TXADDRESS = 0x00;					/* Use logical address 0 (PREFIX0 + BASE0) = 0x8E89BED6 when transmitting */
	NRF_RADIO->RXADDRESSES = 0x01;				/* Enable reception on logical address 0 (PREFIX0 + BASE0) = = 0x8E89BED6 when receiving */
	
}

/* Setting radio packet PCNF0 register configurations and radio mode */
void radio_set_pcnf0_configuration(uint8_t ble_mode)
{ 
	NRF_RADIO->PCNF0   = (PACKET_S0_FIELD_LENGTH     << RADIO_PCNF0_S0LEN_Pos) |  // length of S0 field in bytes. 
	                     (PACKET_S1_FIELD_LENGTH     << RADIO_PCNF0_S1LEN_Pos) |  // length of S1 field in bits.                      
                       (PACKET_LENGTH_FIELD_LENGTH << RADIO_PCNF0_LFLEN_Pos);   // length of length field in bits. 

 switch (ble_mode)
   {
		 case BLE_1MBIT: 
			    NRF_RADIO->PCNF0 |= (RADIO_PCNF0_PLEN_8bit << RADIO_PCNF0_PLEN_Pos); // length of preamble field in bits.
				  break;
		 
		 case BLE_2MBIT: 
			    NRF_RADIO->PCNF0 |= (RADIO_PCNF0_PLEN_16bit << RADIO_PCNF0_PLEN_Pos); // length of preamble field in bits.
				  break;
		 
		 case BLE_LR500KBIT:
		 case BLE_LR125KBIT:
          NRF_RADIO->PCNF0 |= (PACKET_CI_FIELD_LENGTH    << RADIO_PCNF0_CILEN_Pos)   |  // length of CI field in bits.
	                            (PACKET_TERM_FIELD_LENGTH  << RADIO_PCNF0_TERMLEN_Pos) |  // length of TERM field in bits.
	                            (RADIO_PCNF0_PLEN_LongRange << RADIO_PCNF0_PLEN_Pos);		   // length of preamble field in bits.	 		                     
				  break;
		 
	 }		 				        				                       		    	 
}

/* Setting radio packet PCNF1 register configurations */
void radio_set_pcnf1_configuration(void)
{ 

 NRF_RADIO->PCNF1 = (  (PACKET_PAYLOAD_MAXSIZE_LE_DATA  << RADIO_PCNF1_MAXLEN_Pos)     /* maximum length of payload for le adv packet (37 bytes). */
                     | (PACKET_STATIC_LENGTH            << RADIO_PCNF1_STATLEN_Pos) 	/* Static length of the packet  */
                     | (PACKET_BASE_ADDRESS_LENGTH      << RADIO_PCNF1_BALEN_Pos)            /* base address length in number of bytes. */
                     | (RADIO_PCNF1_ENDIAN_Little       << RADIO_PCNF1_ENDIAN_Pos)          /* endianess of the S0, LENGTH, S1 and PAYLOAD fields. */
                     | (RADIO_PCNF1_WHITEEN_Enabled     << RADIO_PCNF1_WHITEEN_Pos) 	      /* enable packet whitening. */
                    );					        				                       		    	  

