MansAbboud/BLE5-Testbed/code/nRF52840_Observer_main.c
}

/* Function for setting radio transmitter power */
void radio_set_tx_power(uint8_t tx_power)
{ 

 switch (tx_power)
   {					
		case 1: NRF_RADIO->TXPOWER = (RADIO_TXPOWER_TXPOWER_Pos8dBm << RADIO_TXPOWER_TXPOWER_Pos);
				    break;
						
		case 2: NRF_RADIO->TXPOWER = (RADIO_TXPOWER_TXPOWER_0dBm << RADIO_TXPOWER_TXPOWER_Pos); 			
            break;								 
                         				
		case 3: NRF_RADIO->TXPOWER = (RADIO_TXPOWER_TXPOWER_Neg8dBm << RADIO_TXPOWER_TXPOWER_Pos);    
            break;

    case 4: NRF_RADIO->TXPOWER = (RADIO_TXPOWER_TXPOWER_Neg20dBm << RADIO_TXPOWER_TXPOWER_Pos);    
            break;		
	 } 
}

/* Function for setting the radio channels ( LE adv channels only ) */
 void radio_ble_ch_set(uint32_t channel)
{
	 switch (channel)
   {		
		 case 37: NRF_RADIO->FREQUENCY = 2U;
		          NRF_RADIO->DATAWHITEIV = channel;   // 37
				      break;
		 
		 case 38: NRF_RADIO->FREQUENCY = 26U;
		          NRF_RADIO->DATAWHITEIV = channel;   // 38
				      break;		 
		 
     case 39: NRF_RADIO->FREQUENCY = 80U;
		          NRF_RADIO->DATAWHITEIV = channel;   // 39
				      break;
		 
		 case 4:  NRF_RADIO->FREQUENCY = 12U;
		          NRF_RADIO->DATAWHITEIV = channel;   // 4
				      break;
						
		 case 15: NRF_RADIO->FREQUENCY = 36U;
              NRF_RADIO->DATAWHITEIV = channel;	  // 15	 
              break;								 
                         				
		 case 28: NRF_RADIO->FREQUENCY = 62U;
              NRF_RADIO->DATAWHITEIV = channel;	  // 28	 
              break;
	
	 }              	  
}

/* Setting scan timer interval */
void measurement_timer_set_interval(uint32_t interval)
{
	uint32_t MEASUREMENT_TIMER_ms = interval; //Time (in miliseconds) 
  uint32_t MEASUREMENT_TIMER_ticks;
	
	MEASUREMENT_TIMER_ticks  = nrf_drv_timer_ms_to_ticks(&MEASUREMENT_TIMER, MEASUREMENT_TIMER_ms);
	nrf_drv_timer_extended_compare(&MEASUREMENT_TIMER, NRF_TIMER_CC_CHANNEL0, MEASUREMENT_TIMER_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
	
}



/* Function for reading the rssi of the packet */
 void radio_rssi_read()
{
	NRF_RADIO->TASKS_RSSISTART = 1;
  while(!NRF_RADIO->EVENTS_RSSIEND);
  NRF_RADIO->EVENTS_RSSIEND = 0;
  rssi_result = NRF_RADIO->RSSISAMPLE;
  NRF_RADIO->TASKS_RSSISTOP = 1;
		
}

/* Function for setting the observer address	*/
void set_device_address()
{ 		 
		for (int i=0; i< LE_ADDR_LENGTH; i++)
		 {
			trigger_packet_tx[i+PDU_HEADER_LENGTH]= OB_addr[i];
		 }		   						
}

/* Setting radio mode */
void radio_ble_set_mode(uint8_t mode)
{
	radio_set_pcnf0_configuration(mode);
	
	switch (mode)
   {					
		case BLE_1MBIT: 
         NRF_RADIO->MODE = (RADIO_MODE_MODE_Ble_1Mbit << RADIO_MODE_MODE_Pos);			
				 break;
						
		case BLE_2MBIT: 
         NRF_RADIO->MODE = (RADIO_MODE_MODE_Ble_2Mbit << RADIO_MODE_MODE_Pos);			
         break;								 
                         				
		case BLE_LR500KBIT: 
         NRF_RADIO->MODE = (RADIO_MODE_MODE_Ble_LR500Kbit << RADIO_MODE_MODE_Pos); 			
         break;

    case BLE_LR125KBIT: 
			   NRF_RADIO->MODE = (RADIO_MODE_MODE_Ble_LR125Kbit << RADIO_MODE_MODE_Pos);   
         break;		
  }	
}

/* Function to set radio transmitted packet  */
void radio_ble_set_packetptr(uint8_t p_ptr)
{
	
	switch (p_ptr)
   {
		
    case PACKET_CONFIG_TRIGGER: 
			   NRF_RADIO->PACKETPTR = (uint32_t)trigger_packet_tx;   
         break;
		 
		case PACKET_CONFIG_ADV: 
			   NRF_RADIO->PACKETPTR = (uint32_t)le_adv_packet_rx;               
				 break;
		 
		case PACKET_CONFIG_MIN: 
			   NRF_RADIO->PACKETPTR = (uint32_t)le_min_packet_rx;    			      
         break;								 
                         				
		case PACKET_CONFIG_DATA: 
			   NRF_RADIO->PACKETPTR = (uint32_t)le_data_packet_rx; 	      
         break;
   				
  }	
}


/* Function for setting the advertising data	*/
void set_adv_data()
{
	  trigger_packet_tx[8] = BLE_MODE;          // 1: BLE 1Mbit, 2: BLE 2Mbit, 3: BLE LR 500Kbit, 4: BLE LR 125Kbit
    trigger_packet_tx[9] = CHANNEL;           // 1: MIN, 2: ADV, 3: DATA(max)
    trigger_packet_tx[10]= PACKET_CONFIG;     // 1: 0dBm, 2: -8dBm, 3: -20dBm  
    trigger_packet_tx[11]= TX_POW;	          // 1: 37, 2: 38, 3: 39
    trigger_packet_tx[12]= batch_counter;
	  trigger_packet_tx[13]= scenario;
}


/* Function for preparing the trigger packet	*/
void prepare_trigger_packet()
{ 	
	  trigger_packet_tx[0]= PDU_HEADER_S0_VALUE;
    trigger_packet_tx[1]= PACKET_PAYLOAD_MAXSIZE_LE_ADV;
 
}


// Function to send control data through UART
static void UART_send_control_data(void)     
{			
   controlArray[0]=254;
	 controlArray[1]=BLE_MODE;
	 controlArray[2]=CHANNEL;
	 controlArray[3]=PACKET_CONFIG;
	 controlArray[4]=TX_POW;
	 controlArray[5]=batch_counter;
	
	 for (int i = 0; i < 6; i++)                                  // loop on all elements of the array, 201 bytes      
	    {        								
        while(app_uart_put(controlArray[i]) != NRF_SUCCESS);				 // send data through UART				
			}										 					 
}


/* Function for sending timestamp trigger packet	*/
void send_trigger_packet()
{
    // initiate the radio as transmitter
    NRF_RADIO->EVENTS_READY = 0U;
    NRF_RADIO->TASKS_TXEN   = 1;

    while (NRF_RADIO->EVENTS_READY == 0U)
    {
        // wait
    }
		// send the packet
    NRF_RADIO->EVENTS_END  = 0U;
    NRF_RADIO->TASKS_START = 1U;

    while (NRF_RADIO->EVENTS_END == 0U)
    {
        // wait
    }

    NRF_RADIO->EVENTS_DISABLED = 0U;
    // Disable radio
    NRF_RADIO->TASKS_DISABLE = 1U;

    while (NRF_RADIO->EVENTS_DISABLED == 0U)
    {
        // wait
    }
		
}

/* Function for disabling the radio	*/
void radio_disable()
{
    NRF_RADIO->TASKS_DISABLE = 1U;
    while (NRF_RADIO->EVENTS_DISABLED == 0U) {/* wait*/}
		NRF_RADIO->EVENTS_DISABLED = 0;
}

/* Initialize default state for radio	*/
void radio_default_init()
{
		
