MansAbboud/BLE5-Testbed/code/nRF52840_Observer_main.c
  BLE_MODE = BLE_1MBIT;
  CHANNEL = 37;
  PACKET_CONFIG = PACKET_CONFIG_ADV;    
  TX_POW = TX_PWR_Pos8dBm;                             
	radio_ble_set_mode(BLE_1MBIT);	
	radio_set_pcnf1_configuration();
  radio_set_tx_power(TX_PWR_Pos8dBm);	
  radio_ble_ch_set(37);
  prepare_trigger_packet();
  set_device_address();	
  	
}

/* Initialize radio for sending trigger packet	*/
void radio_trigger_state_init(void)
{
 // radio always send trigger packet on channel 37 with 1Mbit mode
 radio_ble_set_mode(BLE_1MBIT);
 radio_ble_set_packetptr(PACKET_CONFIG_TRIGGER); // Set payload pointer to trigger packet array
 radio_ble_ch_set(37);
 set_adv_data();  	
}

/* Initialize radio 1Mbit mode	*/
void radio_ble_1Mbit_scenario_start()
{
 radio_disable();
 tp_sent=false;
 nrf_delay_ms(1);
 BLE_MODE = BLE_1MBIT;
 radio_trigger_state_init();
 nrf_delay_ms(1);	
 send_trigger_packet();
 UART_send_control_data();
 radio_ble_set_packetptr(PACKET_CONFIG_DATA);   	
 radio_ble_ch_set(CHANNEL);	
 tp_sent=true;
 nrf_drv_timer_enable(&M_STOP_TIMER);
 	
}

/* Initialize radio 2Mbit mode	*/
void radio_ble_2Mbit_scenario_start()
{
 radio_disable();
 tp_sent=false;
 nrf_delay_ms(1);
 BLE_MODE = BLE_2MBIT;
 radio_trigger_state_init();
 nrf_delay_ms(1);	
 send_trigger_packet();
 radio_ble_set_mode(BLE_2MBIT);
 UART_send_control_data();	
 radio_ble_set_packetptr(PACKET_CONFIG_DATA);     // Set payload pointer to trigger packet array	
 radio_ble_ch_set(CHANNEL);	
 tp_sent=true;
 nrf_drv_timer_enable(&M_STOP_TIMER);
 	
}


/* Initialize radio FEC 500Kbit mode	*/
void radio_ble_500Kbit_scenario_start()
{
	
 radio_disable();
 tp_sent=false;
 nrf_delay_ms(1);
 BLE_MODE = BLE_LR500KBIT;
 radio_trigger_state_init();
 nrf_delay_ms(1);	
 send_trigger_packet();
 radio_ble_set_mode(BLE_LR500KBIT);
 UART_send_control_data();	
 radio_ble_set_packetptr(PACKET_CONFIG_DATA);     // Set payload pointer to trigger packet array	
 radio_ble_ch_set(CHANNEL);	
 tp_sent=true;
 nrf_drv_timer_enable(&M_STOP_TIMER);
	
}

/* Initialize radio FEC 125Kbit mode	*/
void radio_ble_125Kbit_scenario_start()
{
 radio_disable();
 tp_sent=false;
 nrf_delay_ms(1);
 BLE_MODE = BLE_LR125KBIT;
 radio_trigger_state_init();
 nrf_delay_ms(1);	
 send_trigger_packet();
 radio_ble_set_mode(BLE_LR125KBIT);
 UART_send_control_data();	
 radio_ble_set_packetptr(PACKET_CONFIG_DATA);     	
 radio_ble_ch_set(CHANNEL);	
 tp_sent=true;
 nrf_drv_timer_enable(&M_STOP_TIMER); 	
}


/* Function for reading the RSSI of the received packet	*/
int do_env_rssi_sampling(uint32_t channel)
{
   NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Enabled << RADIO_SHORTS_READY_START_Pos;
 
   NRF_RADIO->FREQUENCY = channel;
   NRF_RADIO->TASKS_RXEN = 1;
   while (!NRF_RADIO->EVENTS_READY);
   NRF_RADIO->EVENTS_READY = 0;

   NRF_RADIO->TASKS_RSSISTART = 1;
   while(!NRF_RADIO->EVENTS_RSSIEND);
   NRF_RADIO->EVENTS_RSSIEND = 0;

   int env_rssi_result = NRF_RADIO->RSSISAMPLE;

   NRF_RADIO->TASKS_RSSISTOP = 1;

   NRF_RADIO->TASKS_DISABLE = 1;
   while (!NRF_RADIO->EVENTS_DISABLED);
   NRF_RADIO->EVENTS_DISABLED = 0;
   return env_rssi_result;
}


/* Function for initializing the clock	*/
void clock_initialization()
{
    /* Start 32 MHz crystal oscillator */
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART    = 1;

    /* Wait for the external oscillator to start up */
    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0)
    {
        // Do nothing.
    }
}


/* Function for handling timestamp timer interrupts	*/
void M_STOP_TIMER_event_handler(nrf_timer_event_t event_type, void* p_context)
{    
  switch (event_type)
   {       				 
		case NRF_TIMER_EVENT_COMPARE0:						 					           							 
					      
		     if(broadcaster_missed)     
	         {
		         nrf_drv_timer_disable(&MEASUREMENT_TIMER);               
             nrf_delay_ms(1);						 
				     radio_ble_1Mbit_scenario_start();                  		          	  	
		       } 
								
	       else {nrf_drv_timer_disable(&M_STOP_TIMER);}				  
                
        default:
            //Do nothing.
            break;
    }
}

/* Function for handling timestamp timer interrupts	*/
void TIMESTAMP_TIMER_event_handler(nrf_timer_event_t event_type, void* p_context)
{    
    switch (event_type)
    {        				 
			case NRF_TIMER_EVENT_COMPARE0:
						 					           
           real_time_seconds++; 
					 if( real_time_seconds == 60)
						{
							real_time_minutes++;
						  real_time_seconds=0;
						}

            if( real_time_minutes == 60)
						 {
							real_time_hours++;
							real_time_minutes=0;
						 }								 
					                 					 
					  nrf_gpio_pin_toggle(LED_3_PIN);					  
                
      default:
            //Do nothing.
       break;
    }
}

/* Function for processing advertising channels scenario	*/
void process_adv_scenario()
{
	batch_counter++;
	idx_counter++;
  PER=0;
  measuring=false;
	broadcaster_missed=true;
                        
  if( batch_counter ==5)    // if we reached 4 batches
	 {
		batch_counter=1;
		TX_POW++;								
	 }
							
	if( TX_POW == 5)         // if we reached 4 tx power    should be 5 and 4 without -20
		{
		 batch_counter=1;
		 TX_POW = 1;
 //	 PACKET_CONFIG++;
	  }
							 
	 if( idx_counter <17)    // while 16 batches not reached, 4 batches packets X 4 tx power  13 without -20
		{
     nrf_delay_ms(waiting_delay);
		 radio_ble_1Mbit_scenario_start();
		}
							 
	 if( idx_counter == 17)   // if we reached 16 batch 17, and  13 without -20
		{  																						 
		 CHANNEL++;
									 
			if( CHANNEL == 40){CHANNEL = 37; PACKET_CONFIG++;   }    // break;
		  if( PACKET_CONFIG < 3)
       {  									 
				idx_counter=1;
				nrf_delay_ms(200);
				radio_ble_1Mbit_scenario_start();
			 }
			else{PACKET_CONFIG=1;}
		}			
 	
