MansAbboud/BLE5-Testbed/code/nRF52840_Observer_main.c
}

/* Function for processing data channels scenario	*/
void process_data_scenario()
{	
	 batch_counter++;
	 idx_counter++;
	 data_idx_counter++;
   PER=0;
   measuring=false;
                                      
		if( PACKET_CONFIG < 4)
       { 		

         if( batch_counter ==5)    // if we reached 4 batches   5
					{
					 batch_counter=1;
					 TX_POW++;								
					}
							
				 if( TX_POW == 5)         // if we reached 4 tx power
					{
						batch_counter=1;
						TX_POW = 1;
					}
				 
				 if( idx_counter <17)    // if 16 batches reached, 4 batches packets X 4 tx power     
				  {
            nrf_delay_ms(waiting_delay);
						if(BLE_MODE==1){	radio_ble_1Mbit_scenario_start();}
						if(BLE_MODE==2){	radio_ble_2Mbit_scenario_start();}
						if(BLE_MODE==3){	radio_ble_500Kbit_scenario_start();}
						if(BLE_MODE==4){	radio_ble_125Kbit_scenario_start();}							
				  }
							 
					if( idx_counter == 17)   // if we reached 16 batch      
					 {  							
										
						if( data_idx_counter == 17){CHANNEL = 15;}          
						if( data_idx_counter == 33){CHANNEL = 28;}	                       							 
            if( data_idx_counter == 49){CHANNEL= 4; PACKET_CONFIG++; data_idx_counter=1;}  
                   
									 
								//	 if( PACKET_CONFIG == 2)       // this is only for fec
                //    { 
									 //   measurement_timer_set_interval(1100);
										//	printing_delay = 900;
									//		if(BLE_MODE==3){ measurement_timer_set_interval(600); printing_delay =500;	} 					
					        //    if(BLE_MODE==4){ measurement_timer_set_interval(850); printing_delay = 500;	}
																			 																																			
								//		}
									 
									 
						if( PACKET_CONFIG == 3)
             { 											
					//	if( PACKET_CONFIG == 3 && CHANNEL == 4 ) {nrf_delay_ms(5000); }
							measurement_timer_set_interval(1100);
						  printing_delay = 900;
							if(BLE_MODE==3){ measurement_timer_set_interval(1600); printing_delay =1200;	} 					
					    if(BLE_MODE==4){ measurement_timer_set_interval(4850); printing_delay = 2000;	}																																																						
						 }
                   
            if( PACKET_CONFIG != 4)
             {
               idx_counter=1;
							 nrf_delay_ms(200);
							 if(BLE_MODE==1){	radio_ble_1Mbit_scenario_start();}
							 if(BLE_MODE==2){	radio_ble_2Mbit_scenario_start();}
               if(BLE_MODE==3){	radio_ble_500Kbit_scenario_start();}
							 if(BLE_MODE==4){	radio_ble_125Kbit_scenario_start();}																																											
						 } 																			  									 									  
					 }	
			   }
			 
			else
			 {
				 PACKET_CONFIG=1;
				 data_idx_counter=1;					
				 measurement_timer_set_interval(600); 
				 printing_delay = 400;
         if(BLE_MODE==3){ measurement_timer_set_interval(1100); printing_delay =900;	} 					
				 if(BLE_MODE==4){ measurement_timer_set_interval(850); printing_delay = 600;	}					
				 	
				}			
 	
}

/* Function for processing scan measurement  */
void process_measurement()
{
				
	  if (le_data_packet_rx[2] == 0x11 && le_data_packet_rx[3] == 0x11 )
			{

				if ( measuring == false) 
         {
          nrf_drv_timer_enable(&MEASUREMENT_TIMER);
          measuring = true;
					nrf_gpio_pin_clear(LED_3_PIN);
         }
				nrf_gpio_pin_toggle(LED_4_PIN);
				B1_rec_packets_rssi[B1_packet_counter+1] = rssi_result;
				B1_rec_packets_rssi[B1_packet_counter+252]=le_data_packet_rx[8];
        
				B1_packet_counter++;
				B1_rec_ind = true;
				broadcaster_missed = false;
				rssi_result=0;
				le_data_packet_rx[2]=0;
				le_data_packet_rx[3]=0;
			} 	
}


/* Function for handling measurement timer interrupts	*/
void MEASUREMENT_TIMER_event_handler(nrf_timer_event_t event_type, void* p_context)
{    
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:                  // this event is triggered when the timer fires
				{
				   nrf_drv_timer_disable(&MEASUREMENT_TIMER);
					 nrf_gpio_pin_set(LED_3_PIN);
					 B1_packet_counter=0;
					 nrf_delay_ms(printing_delay);
					 
					 B1_rec_packets_rssi[0]=253;
															
					 for (uint16_t i=2; i < 252; i++)                       
	            { 
								if(B1_rec_packets_rssi[i]==0){PER++;}     
                nrf_delay_us(20);								
			        }
							B1_rec_packets_rssi[503]=PER;
							
							
							for (uint16_t z=0; z < 504; z++)              
	            { 
								while(app_uart_put(B1_rec_packets_rssi[z]) != NRF_SUCCESS);						
			        }
							
					  for (uint16_t x = 0; x < 504; x++)           
	            {        								
                B1_rec_packets_rssi[x]=0;				           // empty the buffer								
			        }
							
							if(scenario==1){process_adv_scenario();}
							if(scenario==2){process_data_scenario();}
							
								
							}
				            			
            break;
					 													
        default:
            //Do nothing.
            break;
    }
}



/* Function for button presses	*/
void button_handler(nrf_drv_gpiote_pin_t pin_no, nrf_gpiote_polarity_t button_action)
{    
        switch (pin_no)
        {
            case BSP_BUTTON_0:      
							 
						     scenario=1;            //adv
						     nrf_delay_ms(700);
				         nrf_gpio_pin_clear(LED_1_PIN);
						     radio_ble_1Mbit_scenario_start();  
						     	
						     break;
						
						case BSP_BUTTON_1:

                scenario=2;         //data
						    CHANNEL=4;
						    measurement_timer_set_interval(1100);
								printing_delay = 600;
						    nrf_delay_ms(700);						    
				        nrf_gpio_pin_clear(LED_1_PIN);
            //    radio_ble_1Mbit_scenario_start();
                radio_ble_125Kbit_scenario_start();						
               						
                 break;								 
                         				
				    case BSP_BUTTON_2:
							   
						     
						     scenario=2;         //data
						     CHANNEL=4;
						     measurement_timer_set_interval(850);
								 printing_delay = 600;
						     nrf_delay_ms(700);						    
				         nrf_gpio_pin_clear(LED_1_PIN);
					   //    radio_ble_2Mbit_scenario_start();						     
					        
