MansAbboud/BLE5-Testbed/code/nRF52840_Observer_main.c
					       radio_ble_500Kbit_scenario_start();
							  
                 break;					                 
        
		     	 case BSP_BUTTON_3:
						     
					       nrf_delay_ms(700);
					       if(BLE_MODE==1){	radio_ble_1Mbit_scenario_start();}
							   if(BLE_MODE==2){	radio_ble_2Mbit_scenario_start();}								 
								 if(BLE_MODE==3){	radio_ble_500Kbit_scenario_start();}
					       
						     						 						 																    						    
                 break;       
        }  
}




// Function to Create timers
static void create_timers()  
{ 
	
	  uint32_t err_code = NRF_SUCCESS;
    
	  uint32_t M_STOP_TIMER_ms = 500;   // half second
	  uint32_t M_STOP_TIMER_ticks;
	
	  uint32_t MEASUREMENT_TIMER_ms = SCAN_INTERVAL; //Time (in miliseconds) between consecutive compare events.
    uint32_t MEASUREMENT_TIMER_ticks;
	
	  uint32_t TIMESTAMP_TIMER_ms = 1000;   // 1 second
	  uint32_t TIMESTAMP_TIMER_ticks;
	
	  nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
		uint32_t TIMER_err_code = NRF_SUCCESS;
    TIMER_err_code = nrf_drv_timer_init(&MEASUREMENT_TIMER, &timer_cfg, MEASUREMENT_TIMER_event_handler);
		TIMER_err_code = nrf_drv_timer_init(&TIMESTAMP_TIMER, &timer_cfg, TIMESTAMP_TIMER_event_handler);
		TIMER_err_code = nrf_drv_timer_init(&M_STOP_TIMER, &timer_cfg, M_STOP_TIMER_event_handler);
    APP_ERROR_CHECK(TIMER_err_code); 
		
		M_STOP_TIMER_ticks    = nrf_drv_timer_ms_to_ticks(&M_STOP_TIMER, M_STOP_TIMER_ms);
    MEASUREMENT_TIMER_ticks  = nrf_drv_timer_ms_to_ticks(&MEASUREMENT_TIMER, MEASUREMENT_TIMER_ms);
    TIMESTAMP_TIMER_ticks    = nrf_drv_timer_ms_to_ticks(&MEASUREMENT_TIMER, TIMESTAMP_TIMER_ms);
		
		nrf_drv_timer_extended_compare(&M_STOP_TIMER, NRF_TIMER_CC_CHANNEL0, M_STOP_TIMER_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
		nrf_drv_timer_extended_compare(&MEASUREMENT_TIMER, NRF_TIMER_CC_CHANNEL0, MEASUREMENT_TIMER_ticks, NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK, true);
		nrf_drv_timer_extended_compare(&TIMESTAMP_TIMER, NRF_TIMER_CC_CHANNEL0, TIMESTAMP_TIMER_ticks, NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK, true);
}


/* Function for configuring GPIO	*/
static void gpio_config(void) 
{
    ret_code_t err_code;
    
   // Initialze driver.
    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    // Configure 4 output pins for LED's.
    nrf_drv_gpiote_out_config_t out_config = GPIOTE_CONFIG_OUT_SIMPLE(false);
    err_code = nrf_drv_gpiote_out_init(LED_1_PIN, &out_config);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_gpiote_out_init(LED_2_PIN, &out_config);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_gpiote_out_init(LED_3_PIN, &out_config);
    APP_ERROR_CHECK(err_code);
	  err_code = nrf_drv_gpiote_out_init(LED_4_PIN, &out_config);
    APP_ERROR_CHECK(err_code);
		
    // Set output pins (this will turn off the LED's).
    nrf_drv_gpiote_out_set(LED_1_PIN);
    nrf_drv_gpiote_out_set(LED_2_PIN);
    nrf_drv_gpiote_out_set(LED_3_PIN);
		nrf_drv_gpiote_out_set(LED_4_PIN);
		
		
		bsp_board_leds_init();

    // Make a configuration for input pins. 
    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    // Configure input pins for buttons, with separate event handlers for each button.
    err_code = nrf_drv_gpiote_in_init(BSP_BUTTON_0, &in_config, button_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_gpiote_in_init(BSP_BUTTON_1, &in_config, button_handler);
    APP_ERROR_CHECK(err_code);
		err_code = nrf_drv_gpiote_in_init(BSP_BUTTON_2, &in_config, button_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_gpiote_in_init(BSP_BUTTON_3, &in_config, button_handler);
    APP_ERROR_CHECK(err_code); 
																					 														 
   //  Enable input pins for buttons.
    nrf_drv_gpiote_in_event_enable(BSP_BUTTON_0, true);
    nrf_drv_gpiote_in_event_enable(BSP_BUTTON_1, true);
		nrf_drv_gpiote_in_event_enable(BSP_BUTTON_2, true);
    nrf_drv_gpiote_in_event_enable(BSP_BUTTON_3, true);
																																							
} 


/* Function for reading the received packets	*/
void read_packet()
{	  
	//  nrf_gpio_pin_clear(LED_1_PIN);
    NRF_RADIO->EVENTS_READY = 0U;
    // Enable radio and wait for ready
    NRF_RADIO->TASKS_RXEN = 1U;
    while (NRF_RADIO->EVENTS_READY == 0U) {/* wait*/}
    		
    NRF_RADIO->EVENTS_END = 0U;
    // Start listening and wait for address received event
    NRF_RADIO->TASKS_START = 1U;
		
		NRF_RADIO->TASKS_RSSISTART = 1;
    while(!NRF_RADIO->EVENTS_RSSIEND);
    NRF_RADIO->EVENTS_RSSIEND = 0;
		
    // Wait for end of packet 
    while (NRF_RADIO->EVENTS_END == 0U) {/* wait*/} 
		
//		current_tick = nrf_drv_timer_capture(&TIMESTAMP_TIMER,  NRF_TIMER_CC_CHANNEL1);                         
    if (NRF_RADIO->CRCSTATUS == 1U)
    { 	
			  rssi_result = NRF_RADIO->RSSISAMPLE;
        NRF_RADIO->TASKS_RSSISTOP = 1;
			  process_measurement();  			
    } 
		
		if (NRF_RADIO->CRCSTATUS == 0U)
    {          				
     // to do something here when the crc returns error	
   //  nrf_gpio_pin_clear(LED_4_PIN);   		
    }
		
    NRF_RADIO->EVENTS_DISABLED = 0U;
    // Disable radio
    NRF_RADIO->TASKS_DISABLE = 1U;
    while (NRF_RADIO->EVENTS_DISABLED == 0U) {/* wait*/}
    
}

/* Function to initialize the UART interface */
 void UART_initialize(void)
{
     uint32_t err_code;
	
		// Application UART interface parameters
	const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud1M
      };
  // Initialize the UART interface
    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOW,
                         err_code);

    APP_ERROR_CHECK(err_code);
	  if (err_code != NRF_SUCCESS){nrf_gpio_pin_clear(LED_1_PIN);}
					 
}


/* main */
int main(void)
{
    uint32_t err_code;

    clock_initialization();

    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	 
	  NRF_RADIO->SHORTS |= RADIO_SHORTS_ADDRESS_RSSISTART_Msk;
	  
	  radio_power_up(); 
	  radio_addr_init();	
	  radio_CRC_init();
		radio_tifs_set();		
    radio_default_init();
	  gpio_config();
		UART_initialize();
		create_timers(); 
		        
    for (;;)
    {			   
         if (tp_sent) {read_packet(); }    //   if trigger packet is sent, start scanning
    }
}

